// Сделайте функцию, которая возвращает квадрат числа. Число передается параметром.
function func1(a) {

}

// Сделайте функцию, которая возвращает сумму двух чисел.
function func2(a, b) {

}

// Сделайте функцию, которая отнимает от первого числа второе и делит на третье.

function func3(a, b, c){

}

// Сделайте функцию, которая принимает параметром число от 1 до 7, а возвращает день недели на русском языке.

function func4(a){

}

// Сделайте функцию, которая параметрами принимает 2 числа. Если эти числа равны - пусть функция вернет true, а если не равны - false.

function func5(a,b) {

}

// Сделайте функцию, которая параметрами принимает 2 числа. Если их сумма больше 10 - пусть вернет true, а если нет то - false.

function func6(a,b){

}

// Сделайте функцию, которая параметром принимает число и проверяет - отрицательное оно или нет. Если отрицательное - пусть функция вернет true, а если нет - false.

function func7(a) {

}

// Сделайте функцию isNumberInRange, которая параметром принимает число и проверяет, что оно больше нуля и меньше 10. Если это так - пусть функция возвращает true, если не так - false.

function isNumberInRange(a){

}

// Дан массив с числами. Запишите в новый массив только те числа, которые больше нуля и меньше 10-ти. Для этого используйте вспомогательную функцию isNumberInRange из предыдущей задачи.

function func8(array){

}

// Сделайте функцию getDigitsSum (digit - это цифра), которая параметром принимает целое число и возвращает сумму его цифр.

function getDigitsSum(digit){

}

// Найдите все года от 1 до 2020, сумма цифр которых равна 13. Для этого используйте вспомогательную функцию getDigitsSum из предыдущей задачи.

function func9(){

}

//  Сделайте функцию isEven() (even - это четный), которая параметром принимает целое число и проверяет: четное оно или нет. Если четное - пусть функция возвращает true, если нечетное - false.

function isEven(a) {

}

//  Дан массив с целыми числами. Создайте из него новый массив, где останутся лежать только четные из этих чисел. Для этого используйте вспомогательную функцию isEven из предыдущей задачи.

function func10(array){

}

// Сделайте функцию getDivisors, которая параметром принимает число и возвращает массив его делителей (чисел, на которое делится данное число).

function getDivisors(number){

}

// Дано число. Сложите его цифры. Если сумма получилась более 9-ти, опять сложите его цифры. И так, пока сумма не станет однозначным числом (9 и менее).

function func11(number) {

}

// Напишите стрелочную функцию, которая будет возвращать true если строка является палиндромом и false в противном случае.

function func12(string) {

}


module.exports = {func1, func2, func3, func4, func5, func6, func7, func8, func9, isNumberInRange, getDigitsSum, isEven, func10, getDivisors, func11, func12};
